# Main menu buttons
CONTINUE_BUTTON = 'Продолжить'
NEW_GAME_BUTTON = 'Новая игра'
CONTROLS_BUTTON = 'Управление'
SETTINGS_BUTTON = 'Настройки'
QUIT_BUTTON = 'Выход'
MM_ESC = 'Esc - Главное меню'
MM_RIGHT = 'Вправо - Движение вправо'
MM_LEFT = 'Влево - Движение влево'
MM_F5 = 'F5 - Быстрое сохранение'
MM_F9 = 'F9 - Быстрая загрузка'
MM_TAB = 'Tab - Инвентарь'
MM_X = 'Ч или Вверх - Использовать/войти'
MM_DOWN = 'Вниз - Присесть'
MM_SPACE = 'Пробел - Прыжок'
ED_MD = 'Перейти к режиму редактора'
GO_TO_ED = 'РЕЖИМ РЕДАКТОРА'

INV_INSC = 'Инвентарь'
KEY_FOUND = 'Найден'
KEY_NOT_FOUND = 'Не найден'


# HELPER SECTION
HLP = {
    'has_item': 'Нажмите "Вверх" или "Ч", чтобы войти',
    'yellow_not': 'Найдите желтый ключ, чтобы открыть',
    'pink_not': 'Найдите розовый ключ, чтобы открыть',
    'green_not': 'Найдите зеленый ключ, чтобы открыть',
    'hammer_not': 'Найдите кувалду, чтобы разбить',
    'hammer_yes': 'Нажмите "Вверх" или "Ч", чтобы разбить стену',
    'sleep_well': 'Нажмите "Вверх" или "Ч", чтобы заснуть',
    'machine': 'Нажмите "Вверх" или "Ч", чтобы починить машину',
    'game_saved': 'Игра сохранена',
    'game_loaded': 'Игра загружена',
}